# Работа с числами
print("##### Работа с числами #####")
# Задача 1
print("----- Задача 01, 02 -----")
a = int(5)
b = int(17)
c = int(a/b)
print("Операция деления целого числа 5 на 17")
print(c)

d = int(b/a)
print("Операция деления целого числа 17 на 5")
print(d)

e = int(b%a)
print("Операция взятия остатка целого числа 5 от 17")
print(e)

f = int(a%b)
print("Операция взятия остатка целого числа 17 от 5")
print(f)

g = int(a ** b)
print("Операция возведения числа 5 в степень 5")
print(g)
print('')

print("----- Задача 03 -----")
param = "string" + str(15)
print(param)
print('')
